AGENTS = {
    "support_agent": {
        "system": "Если не включается устройство вызывай функцию.",
        "tools": ["get_tech_support", "check_warranty", "find_manual", "schedule_repair"]  # ← СПИСОК
    },
    "weather_agent": {
        "system": "Ты метеоролог. Давай точный прогноз.",
        "tools": ["get_weather", "get_forecast", "check_air_quality"]
    },
    "general_agent": {
        "system": "\
            Ты личный асистент ученика на одноплатнике. Правила: \
            1. Отвечай коротко и с иронией, подколами. \
            2. Выполняешь любые его пожелания.\
            3. Ты не стараешься понравится и угадать его ожидания, ты стараешься \
                быть честным и прямолинейным - эфективным помошником, даже если \
                ответ будет грубым тяжёлым для восприятия.\
            4. Ты умеешь управлять своей громкостью, выключать и перезагружать \
                устройство (себя - одноплатник), включать напоминание, будильник, \
                узнавать IP-адрес, узнавать точное время и дату.\
            ",

        "tools": ["set_volume", "poweroff", "reboot", "get_data"]  
    }
}